<a href="https://colab.research.google.com/github/Ipsita45/Ipsita-Barari-Day-3-Python-for-Data-Science-Assignment/blob/main/Ipsita_Barari_Day3_Assignment_in_Python_for_Data_Science.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [3]:
file='https://download.bls.gov/pub/time.series/cu/cu.item'
df=pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item', sep='\t')
df.head()

  item_code  ... sort_sequence
0       AA0  ...             2
1      AA0R  ...           399
2       SA0  ...             1
3      SA0E  ...           374
4     SA0L1  ...           358

[5 rows x 5 columns]

In [5]:
df['item_name']

0                                   All items - old base
1      Purchasing power of the consumer dollar - old ...
2                                              All items
3                                                 Energy
4                                    All items less food
                             ...
394     Tax return preparation and other accounting fees
395                                    College textbooks
396             Food at elementary and secondary schools
397                                   Infants' equipment
398                                   Infants' furniture
Name: item_name, Length: 399, dtype: object

In [6]:
df[['display_level', 'selectable']]

     display_level selectable
0                0          T
1                0          T
2                0          T
3                1          T
4                1          T
..             ...        ...
394              4          T
395              3          T
396              3          T
397              3          T
398              3          T

[399 rows x 2 columns]

In [10]:
df.iloc[:,:]

    item_code  ... sort_sequence
0         AA0  ...             2
1        AA0R  ...           399
2         SA0  ...             1
3        SA0E  ...           374
4       SA0L1  ...           358
..        ...  ...           ...
394   SS68023  ...           352
395   SSEA011  ...           314
396  SSFV031A  ...           122
397   SSGE013  ...           355
398   SSHJ031  ...           165

[399 rows x 5 columns]

In [11]:
df.iloc[:,1:]

                                             item_name  ...  sort_sequence
0                                 All items - old base  ...              2
1    Purchasing power of the consumer dollar - old ...  ...            399
2                                            All items  ...              1
3                                               Energy  ...            374
4                                  All items less food  ...            358
..                                                 ...  ...            ...
394   Tax return preparation and other accounting fees  ...            352
395                                  College textbooks  ...            314
396           Food at elementary and secondary schools  ...            122
397                                 Infants' equipment  ...            355
398                                 Infants' furniture  ...            165

[399 rows x 4 columns]

In [12]:
df.iloc[:,1:].values

array([['All items - old base', 0, 'T', 2],
       ['Purchasing power of the consumer dollar - old base', 0, 'T',
        399],
       ['All items', 0, 'T', 1],
       ...,
       ['Food at elementary and secondary schools', 3, 'T', 122],
       ["Infants' equipment", 3, 'T', 355],
       ["Infants' furniture", 3, 'T', 165]], dtype=object)

In [13]:
df.isnull().sum()

item_code        0
item_name        0
display_level    0
selectable       0
sort_sequence    0
dtype: int64

In [15]:
df['item_name'].value_counts()

Recreation services                                                                                  1
Recreational reading materials                                                                       1
Dried beans, peas, and lentils                                                                       1
Club membership for shopping clubs, fraternal, or other organizations, or participant sports fees    1
Audio equipment                                                                                      1
                                                                                                    ..
Fats and oils                                                                                        1
Cigarettes                                                                                           1
Education                                                                                            1
Energy commodities                                                                                   1
Boys' and girls' footwear                                                                            1
Name: item_name, Length: 399, dtype: int64

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 399 entries, 0 to 398
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   item_code      399 non-null    object
 1   item_name      399 non-null    object
 2   display_level  399 non-null    int64
 3   selectable     399 non-null    object
 4   sort_sequence  399 non-null    int64
dtypes: int64(2), object(3)
memory usage: 15.7+ KB

In [18]:
df.describe()

       display_level  sort_sequence
count     399.000000     399.000000
mean        3.192982     200.000000
std         1.817102     115.325626
min         0.000000       1.000000
25%         2.000000     100.500000
50%         3.000000     200.000000
75%         4.000000     299.500000
max         8.000000     399.000000

In [23]:
df[df['sort_sequence']>200]

    item_code  ... sort_sequence
1        AA0R  ...           399
3        SA0E  ...           374
4       SA0L1  ...           358
5      SA0L12  ...           361
6     SA0L12E  ...           362
..        ...  ...           ...
392   SS62055  ...           276
393   SS68021  ...           351
394   SS68023  ...           352
395   SSEA011  ...           314
397   SSGE013  ...           355

[199 rows x 5 columns]

In [21]:
df.corr()

               display_level  sort_sequence
display_level        1.00000       -0.70548
sort_sequence       -0.70548        1.00000

In [22]:
df['display_level'].value_counts()

3    113
2     70
1     66
4     43
6     37
5     37
7     18
0     12
8      3
Name: display_level, dtype: int64

In [25]:
df.dropna(axis=1)

    item_code  ... sort_sequence
0         AA0  ...             2
1        AA0R  ...           399
2         SA0  ...             1
3        SA0E  ...           374
4       SA0L1  ...           358
..        ...  ...           ...
394   SS68023  ...           352
395   SSEA011  ...           314
396  SSFV031A  ...           122
397   SSGE013  ...           355
398   SSHJ031  ...           165

[399 rows x 5 columns]

In [27]:
pd.isna(df['selectable'])

0      False
1      False
2      False
3      False
4      False
       ...
394    False
395    False
396    False
397    False
398    False
Name: selectable, Length: 399, dtype: bool

In [28]:
df['item_code'].notna()

0      True
1      True
2      True
3      True
4      True
       ...
394    True
395    True
396    True
397    True
398    True
Name: item_code, Length: 399, dtype: bool

In [29]:
df.fillna('Missing')

    item_code  ... sort_sequence
0         AA0  ...             2
1        AA0R  ...           399
2         SA0  ...             1
3        SA0E  ...           374
4       SA0L1  ...           358
..        ...  ...           ...
394   SS68023  ...           352
395   SSEA011  ...           314
396  SSFV031A  ...           122
397   SSGE013  ...           355
398   SSHJ031  ...           165

[399 rows x 5 columns]